"%1$@ Card" = "%1$@ Card";

"%1$@ Credit" = "%1$@ Credit";

"%1$@ Debit" = "%1$@ Debit";

"%1$@ Prepaid" = "%1$@ Preplătit";

"%1$@ account ending in %2$@" = "Contul la %1$@ care se termină în %2$@";

"%1$@ ending in %2$@" = "%1$@ se termină în %2$@";

"%1$@ is not accepted" = "%1$@ nu este acceptat";

"Address line 2 (optional)" = "Rândul 2 pentru adresă (opțional)";

"Apple Pay" = "Apple Pay";

"BSB" = "Număr BSB";

"Bank Account" = "Cont bancar";

"Billing address" = "Adresă de facturare";

"Billing details" = "Detalii de facturare";

"CVC" = "Cod CVC";

"Card information" = "Informații privind cardul";

"Card number" = "Număr card";

"Confirm your %@" = "Confirmați-vă %@";

"Invalid data." = "Datele nu sunt valide.";

"MM / YY" = "LL/AA";

"MM/YY" = "LL/AA";

"Postal Code" = "Cod poștal";

"Shipping Address" = "Adresa de expediere";

"State / Province / Region" = "Stat";

"The BSB you entered is invalid." = "Numărul BSB pe care l-ați introdus nu este valid.";

"The selected brand is not allowed" = "Marca selectată nu este permisă";

"To scan your card, allow camera access in Settings." = "Pentru a vă scana cardul, permiteți accesul camerei din Setări.";

"Your card has expired." = "Cardul dvs. a expirat.";

"Your card number is incomplete." = "Numărul cardului dvs. nu este complet.";

"Your card number is invalid." = "Numărul cardului dvs. nu este valid.";

"Your card's expiration date is incomplete." = "Data de expirare a cardului nu este completă.";

"Your card's expiration date is invalid." = "Data de expirare a cardului dvs. nu este validă.";

"Your card's expiration month is invalid." = "Luna de expirare a cardului nu este validă.";

"Your card's expiration year is invalid." = "Anul de expirare al cardului nu este valid.";

"Your card's security code is incomplete." = "Codul de securitate al cardului dvs. nu este complet.";

"Your card's security code is invalid." = "Codul de securitate al cardului dvs. nu este valid.";

"card number" = "număr card";

"example@example.com" = "exemplu@exemplu.com";

"expiration date" = "data de expirare";
